#Создать список и заполнить его элементами различных типов данных.
#Реализовать скрипт проверки типа данных каждого элемента.
#Использовать функцию type() для проверки типа.
#Элементы списка можно не запрашивать у пользователя, а указать явно,
#в программе.

my_list = [12, None, -77, 'True', True, 9.5]
for elem in my_list:
    print(type(elem))
#my_type(my_list)